RIOT-OS/RIOT/cpu/StellarisWare/inc/lm4f212h5bb.h
//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port D.
//
//*****************************************************************************
#define GPIO_PCTL_PD7_M         0xF0000000  // PD7 mask
#define GPIO_PCTL_PD7_U2TX      0x10000000  // U2TX on PD7
#define GPIO_PCTL_PD7_M0FAULT1  0x40000000  // M0FAULT1 on PD7
#define GPIO_PCTL_PD7_PHB0      0x60000000  // PHB0 on PD7
#define GPIO_PCTL_PD7_WT5CCP1   0x70000000  // WT5CCP1 on PD7
#define GPIO_PCTL_PD7_NMI       0x80000000  // NMI on PD7
#define GPIO_PCTL_PD6_M         0x0F000000  // PD6 mask
#define GPIO_PCTL_PD6_U2RX      0x01000000  // U2RX on PD6
#define GPIO_PCTL_PD6_M0FAULT0  0x04000000  // M0FAULT0 on PD6
#define GPIO_PCTL_PD6_PHA0      0x06000000  // PHA0 on PD6
#define GPIO_PCTL_PD6_WT5CCP0   0x07000000  // WT5CCP0 on PD6
#define GPIO_PCTL_PD5_M         0x00F00000  // PD5 mask
#define GPIO_PCTL_PD5_U6TX      0x00100000  // U6TX on PD5
#define GPIO_PCTL_PD5_WT4CCP1   0x00700000  // WT4CCP1 on PD5
#define GPIO_PCTL_PD4_M         0x000F0000  // PD4 mask
#define GPIO_PCTL_PD4_U6RX      0x00010000  // U6RX on PD4
#define GPIO_PCTL_PD4_WT4CCP0   0x00070000  // WT4CCP0 on PD4
#define GPIO_PCTL_PD3_M         0x0000F000  // PD3 mask
#define GPIO_PCTL_PD3_SSI3TX    0x00001000  // SSI3TX on PD3
#define GPIO_PCTL_PD3_SSI1TX    0x00002000  // SSI1TX on PD3
#define GPIO_PCTL_PD3_IDX0      0x00006000  // IDX0 on PD3
#define GPIO_PCTL_PD3_WT3CCP1   0x00007000  // WT3CCP1 on PD3
#define GPIO_PCTL_PD2_M         0x00000F00  // PD2 mask
#define GPIO_PCTL_PD2_SSI3RX    0x00000100  // SSI3RX on PD2
#define GPIO_PCTL_PD2_SSI1RX    0x00000200  // SSI1RX on PD2
#define GPIO_PCTL_PD2_M0FAULT0  0x00000400  // M0FAULT0 on PD2
#define GPIO_PCTL_PD2_WT3CCP0   0x00000700  // WT3CCP0 on PD2
#define GPIO_PCTL_PD1_M         0x000000F0  // PD1 mask
#define GPIO_PCTL_PD1_SSI3FSS   0x00000010  // SSI3FSS on PD1
#define GPIO_PCTL_PD1_SSI1FSS   0x00000020  // SSI1FSS on PD1
#define GPIO_PCTL_PD1_I2C3SDA   0x00000030  // I2C3SDA on PD1
#define GPIO_PCTL_PD1_M0PWM7    0x00000040  // M0PWM7 on PD1
#define GPIO_PCTL_PD1_M1PWM1    0x00000050  // M1PWM1 on PD1
#define GPIO_PCTL_PD1_WT2CCP1   0x00000070  // WT2CCP1 on PD1
#define GPIO_PCTL_PD0_M         0x0000000F  // PD0 mask
#define GPIO_PCTL_PD0_SSI3CLK   0x00000001  // SSI3CLK on PD0
#define GPIO_PCTL_PD0_SSI1CLK   0x00000002  // SSI1CLK on PD0
#define GPIO_PCTL_PD0_I2C3SCL   0x00000003  // I2C3SCL on PD0
#define GPIO_PCTL_PD0_M0PWM6    0x00000004  // M0PWM6 on PD0
#define GPIO_PCTL_PD0_M1PWM0    0x00000005  // M1PWM0 on PD0
#define GPIO_PCTL_PD0_WT2CCP0   0x00000007  // WT2CCP0 on PD0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port E.
//
//*****************************************************************************
#define GPIO_PCTL_PE7_M         0xF0000000  // PE7 mask
#define GPIO_PCTL_PE7_U1RI      0x10000000  // U1RI on PE7
#define GPIO_PCTL_PE7_CAN1TX    0x80000000  // CAN1TX on PE7
#define GPIO_PCTL_PE6_M         0x0F000000  // PE6 mask
#define GPIO_PCTL_PE6_CAN1RX    0x08000000  // CAN1RX on PE6
#define GPIO_PCTL_PE5_M         0x00F00000  // PE5 mask
#define GPIO_PCTL_PE5_U5TX      0x00100000  // U5TX on PE5
#define GPIO_PCTL_PE5_I2C2SDA   0x00300000  // I2C2SDA on PE5
#define GPIO_PCTL_PE5_M0PWM5    0x00400000  // M0PWM5 on PE5
#define GPIO_PCTL_PE5_M1PWM3    0x00500000  // M1PWM3 on PE5
#define GPIO_PCTL_PE5_CAN0TX    0x00800000  // CAN0TX on PE5
#define GPIO_PCTL_PE4_M         0x000F0000  // PE4 mask
#define GPIO_PCTL_PE4_U5RX      0x00010000  // U5RX on PE4
#define GPIO_PCTL_PE4_I2C2SCL   0x00030000  // I2C2SCL on PE4
#define GPIO_PCTL_PE4_M0PWM4    0x00040000  // M0PWM4 on PE4
#define GPIO_PCTL_PE4_M1PWM2    0x00050000  // M1PWM2 on PE4
#define GPIO_PCTL_PE4_CAN0RX    0x00080000  // CAN0RX on PE4
#define GPIO_PCTL_PE3_M         0x0000F000  // PE3 mask
#define GPIO_PCTL_PE2_M         0x00000F00  // PE2 mask
#define GPIO_PCTL_PE1_M         0x000000F0  // PE1 mask
#define GPIO_PCTL_PE1_U7TX      0x00000010  // U7TX on PE1
#define GPIO_PCTL_PE0_M         0x0000000F  // PE0 mask
#define GPIO_PCTL_PE0_U7RX      0x00000001  // U7RX on PE0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port F.
//
//*****************************************************************************
#define GPIO_PCTL_PF7_M         0xF0000000  // PF7 mask
#define GPIO_PCTL_PF7_I2C2SDA   0x30000000  // I2C2SDA on PF7
#define GPIO_PCTL_PF7_M1FAULT0  0x50000000  // M1FAULT0 on PF7
#define GPIO_PCTL_PF7_T3CCP1    0x70000000  // T3CCP1 on PF7
#define GPIO_PCTL_PF6_M         0x0F000000  // PF6 mask
#define GPIO_PCTL_PF6_I2C2SCL   0x03000000  // I2C2SCL on PF6
#define GPIO_PCTL_PF6_T3CCP0    0x07000000  // T3CCP0 on PF6
#define GPIO_PCTL_PF5_M         0x00F00000  // PF5 mask
#define GPIO_PCTL_PF5_M0FAULT3  0x00400000  // M0FAULT3 on PF5
#define GPIO_PCTL_PF5_T2CCP1    0x00700000  // T2CCP1 on PF5
#define GPIO_PCTL_PF4_M         0x000F0000  // PF4 mask
#define GPIO_PCTL_PF4_U1DTR     0x00010000  // U1DTR on PF4
#define GPIO_PCTL_PF4_M0FAULT2  0x00040000  // M0FAULT2 on PF4
#define GPIO_PCTL_PF4_M1FAULT0  0x00050000  // M1FAULT0 on PF4
#define GPIO_PCTL_PF4_IDX0      0x00060000  // IDX0 on PF4
#define GPIO_PCTL_PF4_T2CCP0    0x00070000  // T2CCP0 on PF4
#define GPIO_PCTL_PF4_TRD3      0x000E0000  // TRD3 on PF4
#define GPIO_PCTL_PF3_M         0x0000F000  // PF3 mask
#define GPIO_PCTL_PF3_U1DSR     0x00001000  // U1DSR on PF3
#define GPIO_PCTL_PF3_SSI1FSS   0x00002000  // SSI1FSS on PF3
#define GPIO_PCTL_PF3_CAN0TX    0x00003000  // CAN0TX on PF3
#define GPIO_PCTL_PF3_M0FAULT1  0x00004000  // M0FAULT1 on PF3
#define GPIO_PCTL_PF3_M1PWM7    0x00005000  // M1PWM7 on PF3
#define GPIO_PCTL_PF3_T1CCP1    0x00007000  // T1CCP1 on PF3
#define GPIO_PCTL_PF3_TRCLK     0x0000E000  // TRCLK on PF3
#define GPIO_PCTL_PF2_M         0x00000F00  // PF2 mask
#define GPIO_PCTL_PF2_U1DCD     0x00000100  // U1DCD on PF2
#define GPIO_PCTL_PF2_SSI1CLK   0x00000200  // SSI1CLK on PF2
#define GPIO_PCTL_PF2_M0FAULT0  0x00000400  // M0FAULT0 on PF2
#define GPIO_PCTL_PF2_M1PWM6    0x00000500  // M1PWM6 on PF2
#define GPIO_PCTL_PF2_T1CCP0    0x00000700  // T1CCP0 on PF2
#define GPIO_PCTL_PF2_C2O       0x00000900  // C2O on PF2
#define GPIO_PCTL_PF2_TRD0      0x00000E00  // TRD0 on PF2
#define GPIO_PCTL_PF1_M         0x000000F0  // PF1 mask
#define GPIO_PCTL_PF1_U1CTS     0x00000010  // U1CTS on PF1
#define GPIO_PCTL_PF1_SSI1TX    0x00000020  // SSI1TX on PF1
#define GPIO_PCTL_PF1_M1PWM5    0x00000050  // M1PWM5 on PF1
#define GPIO_PCTL_PF1_PHB0      0x00000060  // PHB0 on PF1
#define GPIO_PCTL_PF1_T0CCP1    0x00000070  // T0CCP1 on PF1
#define GPIO_PCTL_PF1_C1O       0x00000090  // C1O on PF1
#define GPIO_PCTL_PF1_TRD1      0x000000E0  // TRD1 on PF1
#define GPIO_PCTL_PF0_M         0x0000000F  // PF0 mask
#define GPIO_PCTL_PF0_U1RTS     0x00000001  // U1RTS on PF0
#define GPIO_PCTL_PF0_SSI1RX    0x00000002  // SSI1RX on PF0
#define GPIO_PCTL_PF0_CAN0RX    0x00000003  // CAN0RX on PF0
#define GPIO_PCTL_PF0_M1PWM4    0x00000005  // M1PWM4 on PF0
#define GPIO_PCTL_PF0_PHA0      0x00000006  // PHA0 on PF0
#define GPIO_PCTL_PF0_T0CCP0    0x00000007  // T0CCP0 on PF0
#define GPIO_PCTL_PF0_NMI       0x00000008  // NMI on PF0
#define GPIO_PCTL_PF0_C0O       0x00000009  // C0O on PF0
#define GPIO_PCTL_PF0_TRD2      0x0000000E  // TRD2 on PF0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port G.
//
//*****************************************************************************
#define GPIO_PCTL_PG7_M         0xF0000000  // PG7 mask
#define GPIO_PCTL_PG7_I2C5SDA   0x30000000  // I2C5SDA on PG7
#define GPIO_PCTL_PG7_M0PWM7    0x40000000  // M0PWM7 on PG7
#define GPIO_PCTL_PG7_IDX1      0x50000000  // IDX1 on PG7
#define GPIO_PCTL_PG7_WT1CCP1   0x70000000  // WT1CCP1 on PG7
#define GPIO_PCTL_PG6_M         0x0F000000  // PG6 mask
#define GPIO_PCTL_PG6_I2C5SCL   0x03000000  // I2C5SCL on PG6
#define GPIO_PCTL_PG6_M0PWM6    0x04000000  // M0PWM6 on PG6
#define GPIO_PCTL_PG6_WT1CCP0   0x07000000  // WT1CCP0 on PG6
#define GPIO_PCTL_PG5_M         0x00F00000  // PG5 mask
#define GPIO_PCTL_PG5_U2TX      0x00100000  // U2TX on PG5
#define GPIO_PCTL_PG5_I2C1SDA   0x00300000  // I2C1SDA on PG5
#define GPIO_PCTL_PG5_M0PWM5    0x00400000  // M0PWM5 on PG5
#define GPIO_PCTL_PG5_M1PWM3    0x00500000  // M1PWM3 on PG5
#define GPIO_PCTL_PG5_IDX1      0x00600000  // IDX1 on PG5
#define GPIO_PCTL_PG5_WT0CCP1   0x00700000  // WT0CCP1 on PG5
#define GPIO_PCTL_PG4_M         0x000F0000  // PG4 mask
#define GPIO_PCTL_PG4_U2RX      0x00010000  // U2RX on PG4
#define GPIO_PCTL_PG4_I2C1SCL   0x00030000  // I2C1SCL on PG4
#define GPIO_PCTL_PG4_M0PWM4    0x00040000  // M0PWM4 on PG4
#define GPIO_PCTL_PG4_M1PWM2    0x00050000  // M1PWM2 on PG4
#define GPIO_PCTL_PG4_PHB1      0x00060000  // PHB1 on PG4
#define GPIO_PCTL_PG4_WT0CCP0   0x00070000  // WT0CCP0 on PG4
#define GPIO_PCTL_PG3_M         0x0000F000  // PG3 mask
#define GPIO_PCTL_PG3_I2C4SDA   0x00003000  // I2C4SDA on PG3
#define GPIO_PCTL_PG3_M0FAULT2  0x00004000  // M0FAULT2 on PG3
#define GPIO_PCTL_PG3_M1PWM1    0x00005000  // M1PWM1 on PG3
#define GPIO_PCTL_PG3_PHA1      0x00006000  // PHA1 on PG3
#define GPIO_PCTL_PG3_T5CCP1    0x00007000  // T5CCP1 on PG3
#define GPIO_PCTL_PG2_M         0x00000F00  // PG2 mask
#define GPIO_PCTL_PG2_I2C4SCL   0x00000300  // I2C4SCL on PG2
#define GPIO_PCTL_PG2_M0FAULT1  0x00000400  // M0FAULT1 on PG2
#define GPIO_PCTL_PG2_M1PWM0    0x00000500  // M1PWM0 on PG2
#define GPIO_PCTL_PG2_T5CCP0    0x00000700  // T5CCP0 on PG2
#define GPIO_PCTL_PG1_M         0x000000F0  // PG1 mask
#define GPIO_PCTL_PG1_I2C3SDA   0x00000030  // I2C3SDA on PG1
#define GPIO_PCTL_PG1_M1FAULT2  0x00000050  // M1FAULT2 on PG1
#define GPIO_PCTL_PG1_PHB1      0x00000060  // PHB1 on PG1
#define GPIO_PCTL_PG1_T4CCP1    0x00000070  // T4CCP1 on PG1
#define GPIO_PCTL_PG0_M         0x0000000F  // PG0 mask
#define GPIO_PCTL_PG0_I2C3SCL   0x00000003  // I2C3SCL on PG0
#define GPIO_PCTL_PG0_M1FAULT1  0x00000005  // M1FAULT1 on PG0
#define GPIO_PCTL_PG0_PHA1      0x00000006  // PHA1 on PG0
#define GPIO_PCTL_PG0_T4CCP0    0x00000007  // T4CCP0 on PG0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port H.
//
//*****************************************************************************
#define GPIO_PCTL_PH7_M         0xF0000000  // PH7 mask
#define GPIO_PCTL_PH7_SSI2TX    0x20000000  // SSI2TX on PH7
#define GPIO_PCTL_PH7_M0PWM7    0x40000000  // M0PWM7 on PH7
#define GPIO_PCTL_PH7_WT4CCP1   0x70000000  // WT4CCP1 on PH7
#define GPIO_PCTL_PH6_M         0x0F000000  // PH6 mask
#define GPIO_PCTL_PH6_SSI2RX    0x02000000  // SSI2RX on PH6
#define GPIO_PCTL_PH6_M0PWM6    0x04000000  // M0PWM6 on PH6
#define GPIO_PCTL_PH6_WT4CCP0   0x07000000  // WT4CCP0 on PH6
#define GPIO_PCTL_PH5_M         0x00F00000  // PH5 mask
#define GPIO_PCTL_PH5_SSI2FSS   0x00200000  // SSI2FSS on PH5
#define GPIO_PCTL_PH5_M0PWM5    0x00400000  // M0PWM5 on PH5
#define GPIO_PCTL_PH5_PHB0      0x00500000  // PHB0 on PH5
#define GPIO_PCTL_PH5_WT3CCP1   0x00700000  // WT3CCP1 on PH5
#define GPIO_PCTL_PH4_M         0x000F0000  // PH4 mask
#define GPIO_PCTL_PH4_SSI2CLK   0x00020000  // SSI2CLK on PH4
#define GPIO_PCTL_PH4_M0PWM4    0x00040000  // M0PWM4 on PH4
#define GPIO_PCTL_PH4_PHA0      0x00050000  // PHA0 on PH4
#define GPIO_PCTL_PH4_WT3CCP0   0x00070000  // WT3CCP0 on PH4
#define GPIO_PCTL_PH3_M         0x0000F000  // PH3 mask
#define GPIO_PCTL_PH3_SSI3TX    0x00002000  // SSI3TX on PH3
#define GPIO_PCTL_PH3_M0PWM3    0x00004000  // M0PWM3 on PH3
#define GPIO_PCTL_PH3_M0FAULT3  0x00006000  // M0FAULT3 on PH3
#define GPIO_PCTL_PH3_WT5CCP1   0x00007000  // WT5CCP1 on PH3
#define GPIO_PCTL_PH2_M         0x00000F00  // PH2 mask
#define GPIO_PCTL_PH2_SSI3RX    0x00000200  // SSI3RX on PH2
#define GPIO_PCTL_PH2_M0PWM2    0x00000400  // M0PWM2 on PH2
#define GPIO_PCTL_PH2_M0FAULT2  0x00000600  // M0FAULT2 on PH2
#define GPIO_PCTL_PH2_WT5CCP0   0x00000700  // WT5CCP0 on PH2
#define GPIO_PCTL_PH1_M         0x000000F0  // PH1 mask
#define GPIO_PCTL_PH1_SSI3FSS   0x00000020  // SSI3FSS on PH1
#define GPIO_PCTL_PH1_M0PWM1    0x00000040  // M0PWM1 on PH1
#define GPIO_PCTL_PH1_IDX0      0x00000050  // IDX0 on PH1
#define GPIO_PCTL_PH1_M0FAULT1  0x00000060  // M0FAULT1 on PH1
#define GPIO_PCTL_PH1_WT2CCP1   0x00000070  // WT2CCP1 on PH1
#define GPIO_PCTL_PH0_M         0x0000000F  // PH0 mask
#define GPIO_PCTL_PH0_SSI3CLK   0x00000002  // SSI3CLK on PH0
#define GPIO_PCTL_PH0_M0PWM0    0x00000004  // M0PWM0 on PH0
#define GPIO_PCTL_PH0_M0FAULT0  0x00000006  // M0FAULT0 on PH0
#define GPIO_PCTL_PH0_WT2CCP0   0x00000007  // WT2CCP0 on PH0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port J.
//
//*****************************************************************************
#define GPIO_PCTL_PJ7_M         0xF0000000  // PJ7 mask
#define GPIO_PCTL_PJ6_M         0x0F000000  // PJ6 mask
#define GPIO_PCTL_PJ5_M         0x00F00000  // PJ5 mask
#define GPIO_PCTL_PJ5_U6TX      0x00100000  // U6TX on PJ5
#define GPIO_PCTL_PJ5_T3CCP1    0x00700000  // T3CCP1 on PJ5
#define GPIO_PCTL_PJ4_M         0x000F0000  // PJ4 mask
#define GPIO_PCTL_PJ4_U6RX      0x00010000  // U6RX on PJ4
#define GPIO_PCTL_PJ4_T3CCP0    0x00070000  // T3CCP0 on PJ4
#define GPIO_PCTL_PJ3_M         0x0000F000  // PJ3 mask
#define GPIO_PCTL_PJ3_U5TX      0x00001000  // U5TX on PJ3
#define GPIO_PCTL_PJ3_T2CCP1    0x00007000  // T2CCP1 on PJ3
#define GPIO_PCTL_PJ2_M         0x00000F00  // PJ2 mask
#define GPIO_PCTL_PJ2_U5RX      0x00000100  // U5RX on PJ2
#define GPIO_PCTL_PJ2_IDX0      0x00000500  // IDX0 on PJ2
#define GPIO_PCTL_PJ2_T2CCP0    0x00000700  // T2CCP0 on PJ2
#define GPIO_PCTL_PJ1_M         0x000000F0  // PJ1 mask
#define GPIO_PCTL_PJ1_U4TX      0x00000010  // U4TX on PJ1
#define GPIO_PCTL_PJ1_T1CCP1    0x00000070  // T1CCP1 on PJ1
#define GPIO_PCTL_PJ0_M         0x0000000F  // PJ0 mask
#define GPIO_PCTL_PJ0_U4RX      0x00000001  // U4RX on PJ0
#define GPIO_PCTL_PJ0_T1CCP0    0x00000007  // T1CCP0 on PJ0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port K.
//
//*****************************************************************************
#define GPIO_PCTL_PK7_M         0xF0000000  // PK7 Mask
#define GPIO_PCTL_PK7_M0FAULT3  0x60000000  // M0FAULT3 on PK7
#define GPIO_PCTL_PK7_WT1CCP1   0x70000000  // WT1CCP1 on PK7
#define GPIO_PCTL_PK6_M         0x0F000000  // PK6 Mask
#define GPIO_PCTL_PK6_M0FAULT2  0x06000000  // M0FAULT2 on PK6
#define GPIO_PCTL_PK6_WT1CCP0   0x07000000  // WT1CCP0 on PK6
#define GPIO_PCTL_PK6_C2O       0x08000000  // C2O on PK6
#define GPIO_PCTL_PK5_M         0x00F00000  // PK5 Mask
#define GPIO_PCTL_PK5_U7TX      0x00100000  // U7TX on PK5
#define GPIO_PCTL_PK5_M0FAULT1  0x00600000  // M0FAULT1 on PK5
#define GPIO_PCTL_PK5_C1O       0x00800000  // C1O on PK5
#define GPIO_PCTL_PK4_M         0x000F0000  // PK4 Mask
#define GPIO_PCTL_PK4_U7RX      0x00010000  // U7RX on PK4
#define GPIO_PCTL_PK4_M0FAULT0  0x00060000  // M0FAULT0 on PK4
#define GPIO_PCTL_PK4_RTCCLK    0x00070000  // RTCCLK on PK4
#define GPIO_PCTL_PK4_C0O       0x00080000  // C0O on PK4
#define GPIO_PCTL_PK3_M         0x0000F000  // PK3 Mask
#define GPIO_PCTL_PK3_SSI3TX    0x00002000  // SSI3TX on PK3
#define GPIO_PCTL_PK3_M1FAULT3  0x00006000  // M1FAULT3 on PK3
#define GPIO_PCTL_PK2_M         0x00000F00  // PK2 Mask
#define GPIO_PCTL_PK2_SSI3RX    0x00000200  // SSI3RX on PK2
#define GPIO_PCTL_PK2_M1FAULT2  0x00000600  // M1FAULT2 on PK2
#define GPIO_PCTL_PK1_M         0x000000F0  // PK1 Mask
#define GPIO_PCTL_PK1_SSI3FSS   0x00000020  // SSI3FSS on PK1
#define GPIO_PCTL_PK1_M1FAULT1  0x00000060  // M1FAULT1 on PK1
#define GPIO_PCTL_PK0_M         0x0000000F  // PK0 Mask
#define GPIO_PCTL_PK0_SSI3CLK   0x00000002  // SSI3CLK on PK0
#define GPIO_PCTL_PK0_M1FAULT0  0x00000006  // M1FAULT0 on PK0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port L.
//
//*****************************************************************************
#define GPIO_PCTL_PL7_M         0xF0000000  // PL7 Mask
#define GPIO_PCTL_PL7_T3CCP1    0x70000000  // T3CCP1 on PL7
#define GPIO_PCTL_PL7_WT3CCP1   0x80000000  // WT3CCP1 on PL7
#define GPIO_PCTL_PL6_M         0x0F000000  // PL6 Mask
#define GPIO_PCTL_PL6_T3CCP0    0x07000000  // T3CCP0 on PL6
#define GPIO_PCTL_PL6_WT3CCP0   0x08000000  // WT3CCP0 on PL6
#define GPIO_PCTL_PL5_M         0x00F00000  // PL5 Mask
#define GPIO_PCTL_PL5_T2CCP1    0x00700000  // T2CCP1 on PL5
#define GPIO_PCTL_PL5_WT2CCP1   0x00800000  // WT2CCP1 on PL5
#define GPIO_PCTL_PL5_LPC0RESET_N \
                                0x00F00000  // LPC0RESET_N on PL5
#define GPIO_PCTL_PL4_M         0x000F0000  // PL4 Mask
#define GPIO_PCTL_PL4_T2CCP0    0x00070000  // T2CCP0 on PL4
#define GPIO_PCTL_PL4_WT2CCP0   0x00080000  // WT2CCP0 on PL4
#define GPIO_PCTL_PL4_LPC0FRAME_N \
                                0x000F0000  // LPC0FRAME_N on PL4
#define GPIO_PCTL_PL3_M         0x0000F000  // PL3 Mask
#define GPIO_PCTL_PL3_T1CCP1    0x00007000  // T1CCP1 on PL3
#define GPIO_PCTL_PL3_WT1CCP1   0x00008000  // WT1CCP1 on PL3
#define GPIO_PCTL_PL2_M         0x00000F00  // PL2 Mask
#define GPIO_PCTL_PL2_T1CCP0    0x00000700  // T1CCP0 on PL2
#define GPIO_PCTL_PL2_WT1CCP0   0x00000800  // WT1CCP0 on PL2
#define GPIO_PCTL_PL1_M         0x000000F0  // PL1 Mask
#define GPIO_PCTL_PL1_T0CCP1    0x00000070  // T0CCP1 on PL1
#define GPIO_PCTL_PL1_WT0CCP1   0x00000080  // WT0CCP1 on PL1
#define GPIO_PCTL_PL0_M         0x0000000F  // PL0 Mask
#define GPIO_PCTL_PL0_T0CCP0    0x00000007  // T0CCP0 on PL0
#define GPIO_PCTL_PL0_WT0CCP0   0x00000008  // WT0CCP0 on PL0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port M.
//
//*****************************************************************************
#define GPIO_PCTL_PM7_M         0xF0000000  // PM7 Mask
#define GPIO_PCTL_PM7_M0PWM5    0x20000000  // M0PWM5 on PM7
#define GPIO_PCTL_PM7_WT0CCP1   0x70000000  // WT0CCP1 on PM7
#define GPIO_PCTL_PM6_M         0x0F000000  // PM6 Mask
#define GPIO_PCTL_PM6_M0PWM4    0x02000000  // M0PWM4 on PM6
#define GPIO_PCTL_PM6_WT0CCP0   0x07000000  // WT0CCP0 on PM6
#define GPIO_PCTL_PM5_M         0x00F00000  // PM5 Mask
#define GPIO_PCTL_PM4_M         0x000F0000  // PM4 Mask
#define GPIO_PCTL_PM3_M         0x0000F000  // PM3 Mask
#define GPIO_PCTL_PM3_T5CCP1    0x00007000  // T5CCP1 on PM3
#define GPIO_PCTL_PM3_WT5CCP1   0x00008000  // WT5CCP1 on PM3
#define GPIO_PCTL_PM2_M         0x00000F00  // PM2 Mask
#define GPIO_PCTL_PM2_T5CCP0    0x00000700  // T5CCP0 on PM2
#define GPIO_PCTL_PM2_WT5CCP0   0x00000800  // WT5CCP0 on PM2
#define GPIO_PCTL_PM2_LPC0CLKRUN_N \
                                0x00000F00  // LPC0CLKRUN_N on PM2
#define GPIO_PCTL_PM1_M         0x000000F0  // PM1 Mask
#define GPIO_PCTL_PM1_T4CCP1    0x00000070  // T4CCP1 on PM1
#define GPIO_PCTL_PM1_WT4CCP1   0x00000080  // WT4CCP1 on PM1
#define GPIO_PCTL_PM1_LPC0SCI_N 0x000000F0  // LPC0SCI_N on PM1
#define GPIO_PCTL_PM0_M         0x0000000F  // PM0 Mask
#define GPIO_PCTL_PM0_T4CCP0    0x00000007  // T4CCP0 on PM0
#define GPIO_PCTL_PM0_WT4CCP0   0x00000008  // WT4CCP0 on PM0
#define GPIO_PCTL_PM0_LPC0PD_N  0x0000000F  // LPC0PD_N on PM0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port N.
//
//*****************************************************************************
#define GPIO_PCTL_PN7_M         0xF0000000  // PN7 Mask
#define GPIO_PCTL_PN7_M1PWM7    0x20000000  // M1PWM7 on PN7
#define GPIO_PCTL_PN7_WT4CCP1   0x70000000  // WT4CCP1 on PN7
#define GPIO_PCTL_PN6_M         0x0F000000  // PN6 Mask
#define GPIO_PCTL_PN6_M1PWM6    0x02000000  // M1PWM6 on PN6
#define GPIO_PCTL_PN6_WT4CCP0   0x07000000  // WT4CCP0 on PN6
#define GPIO_PCTL_PN5_M         0x00F00000  // PN5 Mask
#define GPIO_PCTL_PN5_M1PWM5    0x00200000  // M1PWM5 on PN5
#define GPIO_PCTL_PN5_WT3CCP1   0x00700000  // WT3CCP1 on PN5
#define GPIO_PCTL_PN4_M         0x000F0000  // PN4 Mask
#define GPIO_PCTL_PN4_M1PWM4    0x00020000  // M1PWM4 on PN4
#define GPIO_PCTL_PN4_WT3CCP0   0x00070000  // WT3CCP0 on PN4
#define GPIO_PCTL_PN3_M         0x0000F000  // PN3 Mask
#define GPIO_PCTL_PN3_M0PWM7    0x00002000  // M0PWM7 on PN3
#define GPIO_PCTL_PN3_WT2CCP1   0x00007000  // WT2CCP1 on PN3
#define GPIO_PCTL_PN2_M         0x00000F00  // PN2 Mask
#define GPIO_PCTL_PN2_M0PWM6    0x00000200  // M0PWM6 on PN2
#define GPIO_PCTL_PN2_WT2CCP0   0x00000700  // WT2CCP0 on PN2
#define GPIO_PCTL_PN1_M         0x000000F0  // PN1 Mask
#define GPIO_PCTL_PN1_CAN0TX    0x00000010  // CAN0TX on PN1
#define GPIO_PCTL_PN0_M         0x0000000F  // PN0 Mask
#define GPIO_PCTL_PN0_CAN0RX    0x00000001  // CAN0RX on PN0

//*****************************************************************************
//
// The following are defines for the bit fields in the GPIO_PCTL register for
// port P.
//
//*****************************************************************************
#define GPIO_PCTL_PP7_M         0xF0000000  // PP7 Mask
#define GPIO_PCTL_PP7_M0PWM7    0x10000000  // M0PWM7 on PP7
#define GPIO_PCTL_PP7_WT1CCP1   0x70000000  // WT1CCP1 on PP7
#define GPIO_PCTL_PP6_M         0x0F000000  // PP6 Mask
#define GPIO_PCTL_PP6_M0PWM6    0x01000000  // M0PWM6 on PP6
#define GPIO_PCTL_PP6_WT1CCP0   0x07000000  // WT1CCP0 on PP6
#define GPIO_PCTL_PP5_M         0x00F00000  // PP5 Mask
#define GPIO_PCTL_PP5_M0PWM5    0x00100000  // M0PWM5 on PP5
#define GPIO_PCTL_PP5_WT0CCP1   0x00700000  // WT0CCP1 on PP5
#define GPIO_PCTL_PP4_M         0x000F0000  // PP4 Mask
#define GPIO_PCTL_PP4_M0PWM4    0x00010000  // M0PWM4 on PP4
#define GPIO_PCTL_PP4_WT0CCP0   0x00070000  // WT0CCP0 on PP4
#define GPIO_PCTL_PP3_M         0x0000F000  // PP3 Mask
#define GPIO_PCTL_PP3_M0PWM3    0x00001000  // M0PWM3 on PP3
#define GPIO_PCTL_PP3_T5CCP1    0x00007000  // T5CCP1 on PP3
#define GPIO_PCTL_PP2_M         0x00000F00  // PP2 Mask
#define GPIO_PCTL_PP2_M0PWM2    0x00000100  // M0PWM2 on PP2
#define GPIO_PCTL_PP2_T5CCP0    0x00000700  // T5CCP0 on PP2
#define GPIO_PCTL_PP1_M         0x000000F0  // PP1 Mask
#define GPIO_PCTL_PP1_M0PWM1    0x00000010  // M0PWM1 on PP1
#define GPIO_PCTL_PP1_T4CCP1    0x00000070  // T4CCP1 on PP1
#define GPIO_PCTL_PP0_M         0x0000000F  // PP0 Mask
#define GPIO_PCTL_PP0_M0PWM0    0x00000001  // M0PWM0 on PP0
#define GPIO_PCTL_PP0_T4CCP0    0x00000007  // T4CCP0 on PP0

